furniture_app/app/views/manufacturers/profiles/show.html.erb

    <div class="chat-list" style="display: none">
        <% @manufacturer_chats.chats.each do |chat| %>
---
SELECT "chats".* FROM "chats" WHERE "chats"."manufacturer_id" = $1  [["manufacturer_id", 1]]