furniture_app/app/views/users/profiles/show.html.erb

                <% prod_set.prod_data.each do |product_id, quantity| %>
                  <% product = Product.find(product_id) %>
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]