furniture_app/app/views/users/profiles/show.html.erb

                <% prod_set.prod_data.each do |product_id, quantity| %>
                  <% product = Product.find(product_id) %>
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    <div class="chat-list" style="display: none">
        <% @user_chats.chats.each do |chat| %>
---
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = $1  [["user_id", 1]]