furniture_app/app/views/users/profiles/show.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 4]]
---
    <div class="item-cat" id="item-list-cat">
      <p class="item-cat-title"><%= t('.order') %></p>

SELECT "prod_sets".* FROM "prod_sets" WHERE "prod_sets"."user_id" = $1  [["user_id", 4]]
---
            <div>
              <%= form.submit value: t('prod_sets.new.value'), class: 'save-prod-set' %>

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
                          <% prod_set.prod_data.each do |product_id, quantity| %>
                            <% product = Product.find(product_id) %>