furniture_app/app/views/chats/index.html.erb

                <h3>
                  <% user = User.find(chat.user_id) if chat.user_id.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]