furniture_app/app/channels/chat_channel.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def receive(data)
    user = User.find(params[:user_id])