furniture_app/app/views/products/index.html.erb

SELECT "furnitures".* FROM "furnitures" WHERE "furnitures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% @products.each do |product| %>
      <% furniture = Furniture.find(product.furniture_id) %>