furniture_app/app/views/products/show.html.erb

SELECT "furnitures".* FROM "furnitures" WHERE "furnitures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <div class="product-details">
    <% furniture = Furniture.find(@product.furniture_id) %>

SELECT "prod_sets".* FROM "prod_sets"
---
        <label for="prod_set">Виберіть сет:</label>
        <%= select_tag(:prod_set, options_for_select(ProdSet.all.map { |ps| [ps.set_name, ps.id] })) %>