furniture_app/app/controllers/manufacturers/profiles_controller.rb

SELECT "furnitures".* FROM "furnitures"
SELECT "sub_categories".* FROM "sub_categories"
---
  def show
    @manufacturer = current_manufacturer.id
    @product = Product.new
    @furniture_name = Furniture.all.map { |f| [f.name, f.id] }
    @sub_category_name = SubCategory.all.map { |f| [f.subcat_name, f.id] }