furniture_app/app/controllers/users/profiles_controller.rb

  def show
    @orders = current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 4]]