furniture_app/app/controllers/users/registrations_controller.rb

  def check_info_users
    email = params[:user][:email]
    phone_number = params[:user][:phone_number]
    if User.exists?(email: email)
      redirect_to new_user_registration_path, alert: 'Цей email вже зареєстрований'
    elsif User.exists?(phone_number: phone_number)
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bodyn@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."phone_number" = $1 LIMIT $2  [["phone_number", "sdfsdf"], ["LIMIT", 1]]