furniture_app/app/controllers/chats_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = $1 ORDER BY "messages"."created_at" ASC  [["chat_id", 8]]
---
  def show
    @chat = Chat.find(params[:id])
    @messages = @chat.messages.order(created_at: :asc)

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @manufacturer = Manufacturer.find(params[:manufacturer_id])