furniture_app/app/controllers/chats_controller.rb

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = $1 AND "chats"."manufacturer_id" = $2 LIMIT $3  [["user_id", 1], ["manufacturer_id", 1], ["LIMIT", 1]]
INSERT INTO "chats" ("user_id", "manufacturer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["manufacturer_id", 1], ["created_at", "2024-04-13 15:26:56.489947"], ["updated_at", "2024-04-13 15:26:56.489947"]]
---
def create
    @manufacturer = Manufacturer.find(params[:manufacturer_id])
    @chat = Chat.find_by(user_id: current_user.id, manufacturer_id: @manufacturer.id)

    if @chat.present?
      redirect_to chat_path(@chat)
    else
      @chat = Chat.new(user_id: current_user.id, manufacturer_id: @manufacturer.id)
      if @chat.save

SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @chat = Chat.find(params[:id])