furniture_app/app/controllers/messages_controller.rb

  def create
    @chat = Chat.find(params[:chat_id])
    @message = @chat.messages.new(message_params)

    if user_type == "Виробник"
      @message.manufacturer_id = current_manufacturer.id
    else
      @message.user_id = current_user.id
    end

    if @message.save
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "chat_id", "user_id", "manufacturer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "dfgdfg"], ["chat_id", 8], ["user_id", 1], ["manufacturer_id", nil], ["created_at", "2024-04-15 05:19:52.195098"], ["updated_at", "2024-04-15 05:19:52.195098"]]