furniture_app/app/controllers/orders_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def new
    @product = Product.find(params[:product_id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "orders" ("product_id", "quantity", "total_price", "created_at", "updated_at", "user_id", "delivery_day") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @product = Product.find(params[:order][:product_id])
    @order = Order.new(order_params)
    @order.user_id = current_user.id if current_user
    @order.total_price = @product.price * @order.quantity

    respond_to do |format|
      if @order.save