furniture_app/app/controllers/products_controller.rb

SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."sub_category_id" = $1 ORDER BY "products"."prod_model" ASC  [["sub_category_id", 39]]
SELECT "products".* FROM "products" ORDER BY "products"."price" DESC
SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."manufacturer_id" = $1 ORDER BY "products"."prod_model" ASC  [["manufacturer_id", 1]]
---
  def index
    sort_by = params[:sort] || 'name'
    direction = params[:direction] || 'asc'

    if params[:sub_category_id].present?
      sub_category = SubCategory.find(params[:sub_category_id])
      @products = if sort_by == 'name'
                    sub_category.products.order(prod_model: direction.to_sym)
                  elsif sort_by == 'price'
                    sub_category.products.order(price: direction.to_sym)
                  else
                    sub_category.products
                  end
    elsif params[:manufacturer_id].present?
      manufacturer = Manufacturer.find(params[:manufacturer_id])
      @products = if sort_by == 'name'
                    manufacturer.products.order(prod_model: direction.to_sym)

INSERT INTO "products" ("furniture_id", "manufacturer_id", "sub_category_id", "prod_model", "price", "description", "created_at", "updated_at", "delivery_days", "production_days") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    acceptable_image

    respond_to do |format|
      if @product.errors.empty? && @product.save