furniture_app/app/controllers/prod_sets_controller.rb

SELECT "prod_sets".* FROM "prod_sets"
---
  def index
    @prod_sets = ProdSet.all

INSERT INTO "prod_sets" ("user_id", "set_name", "prod_data", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["set_name", "asdas"], ["prod_data", ""], ["created_at", "2024-04-13 10:18:40.513176"], ["updated_at", "2024-04-13 10:18:40.513176"]]
---
  def create
    @prod_set = current_user.prod_sets.build(prod_set_params)

    respond_to do |format|
      if @prod_set.save

SELECT "prod_sets".* FROM "prod_sets" WHERE "prod_sets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "prod_sets" SET "prod_data" = $1, "updated_at" = $2 WHERE "prod_sets"."id" = $3  [["prod_data", "\"3\"=>\"2\""], ["updated_at", "2024-04-13 20:43:52.585603"], ["id", 2]]
---
  def add_product_to_set
    product_id = params[:product_id]
    quantity = params[:quantity].to_i

    prod_set = ProdSet.find(params[:prod_set])

    prod_set.prod_data ||= {}
    prod_set.prod_data.merge!({ product_id.to_s => quantity })

    if prod_set.save

SELECT "prod_sets".* FROM "prod_sets" WHERE "prod_sets"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "prod_sets" SET "prod_data" = $1, "updated_at" = $2 WHERE "prod_sets"."id" = $3  [["prod_data", "\"\"=>\"7\""], ["updated_at", "2024-04-07 13:07:52.886796"], ["id", 2]]
---
  def update
    prod_set = ProdSet.find(params[:id])

    form_data = params[:prod_set] || {}

    form_data.each do |product_id, quantity|
      form_data.delete(product_id) if quantity.to_i.zero?
    end

    prod_set.prod_data = form_data

    if prod_set.save

SELECT "prod_sets".* FROM "prod_sets" WHERE "prod_sets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_prod_set
    @prod_set = ProdSet.find(params[:id])