furniture_app/app/controllers/sub_categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."cat_name" = $1 LIMIT $2  [["cat_name", "Кухня"], ["LIMIT", 1]]
---
  def index
    @category = Category.find_by(cat_name: params[:category_name])

SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = $1  [["category_id", 8]]
---
  def set_sub_category
    @sub_category = SubCategory.find(params[:id])